recept/src/Documents/ЗаказКлиента/ЗаказКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказКлиента</name>
  <registerRecords>AccumulationRegister.ОстаткиМатериалов</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыРезервы</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Покупатели</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.НоменклатураМатериалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВходнойКонтроль</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Производство</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НДССтавка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВсегоСНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

recept/src/InformationRegisters/СтавкаНДСТовар/СтавкаНДСТовар.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтавкаНДСТовар</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Ставка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
</mdclass:InformationRegister>

recept/src/AccumulationRegisters/ОстаткиМатериалов/ОстаткиМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиМатериалов</name>
  <resources>
    <name>Остаток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Наименование</name>
    <type>
      <types>CatalogRef.НоменклатураМатериалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DocumentRef.ВыпускПродукции</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

recept/src/Enums/ВариантОбеспеченияПоставки/ВариантОбеспеченияПоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантОбеспеченияПоставки</name>
  <enumValues>
    <name>Резерв</name>
  </enumValues>
  <enumValues>
    <name>РезервИДопроизводство</name>
  </enumValues>
  <enumValues>
    <name>ТолькоПроизводство</name>
  </enumValues>
</mdclass:Enum>

recept/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНоменклатуры</name>
  <enumValues>
    <name>Продукция</name>
  </enumValues>
  <enumValues>
    <name>Сырье</name>
  </enumValues>
  <enumValues>
    <name>УслугаРазделитель</name>
  </enumValues>
  <enumValues>
    <name>Комплект</name>
  </enumValues>
</mdclass:Enum>

recept/src/Documents/ВыпускПродукции/ВыпускПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыпускПродукции</name>
  <basedOn>Document.Рецептуры</basedOn>
  <registerRecords>AccumulationRegister.СтоимостьМатериалов</registerRecords>
  <registerRecords>InformationRegister.ЦеныМатериалов</registerRecords>
  <registerRecords>InformationRegister.СтатусПродукции</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиМатериалов</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.Рецептуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокументаОснования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Счет</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусПоУмолчанию</name>
    <type>
      <types>EnumRef.СтатусыГотовностиПродукции</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Продукция</name>
    <attributes>
      <name>НаменованиеПродукции</name>
      <type>
        <types>CatalogRef.НоменклатураМатериалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристики</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеОбеспечения</name>
      <type>
        <types>EnumRef.СтатусыГотовностиПродукции</types>
      </type>
    </attributes>
    <attributes>
      <name>Остаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вязкость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Перетир</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВходнойКонтроль</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

recept/src/Documents/РасходнаяНакладная/РасходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходнаяНакладная</name>
  <registerRecords>AccumulationRegister.СтоимостьМатериалов</registerRecords>
  <registerRecords>InformationRegister.СтатусПродукции</registerRecords>
  <registerRecords>InformationRegister.СведенияВПродукцииИзСчетов</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиМатериалов</registerRecords>
  <registerRecords>InformationRegister.СтатусОбеспеченияЗаказа</registerRecords>
  <registerRecords>AccumulationRegister.ПотребностьМатериалов</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыРезервы</registerRecords>
  <attributes>
    <name>НомерНакладной</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНакладной</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отгрузка</name>
    <type>
      <types>EnumRef.СтатусыЗаказаКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Покупатели</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусОбеспеченияЗаказа</name>
    <type>
      <types>EnumRef.СтытусОбеспеченияЗаказа</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.НоменклатураМатериалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Остаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаПродажи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаПокупки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Действие</name>
      <type>
        <types>EnumRef.СтатусыГотовностиПродукции</types>
      </type>
    </attributes>
    <attributes>
      <name>Продано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Потребность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипНоменклатуры</name>
      <type>
        <types>EnumRef.ТипыНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ВариантОбеспеченияПоставки</name>
      <type>
        <types>EnumRef.ВариантОбеспеченияПоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикиНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

recept/src/Catalogs/НоменклатураМатериалы/НоменклатураМатериалы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НоменклатураМатериалы</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Архив</name>
      <description>Архив</description>
    </items>
    <items>
      <name>Продукция</name>
      <description>Продукция</description>
    </items>
    <items>
      <name>Сырье</name>
      <description>Сырье</description>
    </items>
    <items>
      <name>z_Архив</name>
      <description>Z архив</description>
    </items>
  </predefined>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.НоменклатураМатериалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияСырья</name>
    <type>
      <types>EnumRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>МинимальныйОстаток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Цвет</name>
    <type>
      <types>CatalogRef.Цвет</types>
    </type>
  </attributes>
  <attributes>
    <name>RAL</name>
    <type>
      <types>CatalogRef.RAL</types>
    </type>
  </attributes>
  <attributes>
    <name>Фасовка</name>
    <type>
      <types>CatalogRef.Фасовка</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестоХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Вязкость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Перетир</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХарактеристикиНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
</mdclass:Catalog>

recept/src/Documents/ЗаказКлиента/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// 1. Стандартная логика виртуальных колонок
    ОбновитьВиртуальныеКолонкиНаСервере();
    
    // 2. Логика "Жесткой блокировки" входного контроля
    УстановитьДоступностьВходногоКонтроляНаСервере();
    
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ОбновитьВиртуальныеКолонкиНаСервере();
    
    // Перепроверяем блокировку при каждом чтении
    УстановитьДоступностьВходногоКонтроляНаСервере();
    
КонецПроцедуры


&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбновитьВиртуальныеКолонкиНаСервере();
    
    // После записи ситуация могла измениться (редко, но для надежности)
    УстановитьДоступностьВходногоКонтроляНаСервере();
    
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	СтрокаТЧ = Элементы.Товары.ТекущиеДанные;
    Если СтрокаТЧ <> Неопределено Тогда
        // Сразу обновляем визуальное поле, чтобы менеджер видел результат
        СтрокаТЧ.СтрокаПоискаТовара = Строка(СтрокаТЧ.Номенклатура);
    КонецЕсли;

        ОбработатьИзменениеАналитикиСтроки(СтрокаТЧ);

КонецПроцедуры

&НаКлиенте
Процедура ТоварыХарактеристикаПриИзменении(Элемент)
	
	СтрокаТЧ = Элементы.Товары.ТекущиеДанные;
    Если СтрокаТЧ = Неопределено Тогда Возврат; КонецЕсли;
    
    ОбработатьИзменениеАналитикиСтроки(СтрокаТЧ);

КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	СтрокаТЧ = Элементы.Товары.ТекущиеДанные;
    Если СтрокаТЧ = Неопределено Тогда Возврат; КонецЕсли;
    
    // Пересчет имеет смысл, только если заполнена связка Номенклатура + Характеристика
    Если АналитикаСтрокиЗаполнена(СтрокаТЧ) Тогда
        РассчитатьСтроку(СтрокаТЧ);
        ОбновитьВариантОбеспечения(СтрокаТЧ);
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	СтрокаТЧ = Элементы.Товары.ТекущиеДанные;
    Если СтрокаТЧ = Неопределено Тогда Возврат; КонецЕсли;
    
    // ЦенаПродажи не влияет на обеспечение, только на суммы
    Если АналитикаСтрокиЗаполнена(СтрокаТЧ) Тогда
        РассчитатьСтроку(СтрокаТЧ);
    КонецЕсли;

КонецПроцедуры

//Процедура ТоварыСтрокаПоискаТовара...

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьДоступностьВходногоКонтроляНаСервере()
    
    // Если документ новый, блокировать нечего
    Если Объект.Ссылка.Пустая() Тогда
        Элементы.ТоварыВходнойКонтроль.ТолькоПросмотр = Ложь;
        //Элементы.ДекорацияВходнойКонтрольЗаблокирован.Видимость = Ложь;
        Возврат;
    КонецЕсли;
    
    // Проверяем наличие проведенных выпусков по этому заказу
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ ПЕРВЫЕ 1
        |	ВыпускПродукции.Ссылка КАК Ссылка
        |ИЗ
        |	Документ.ВыпускПродукции КАК ВыпускПродукции
        |ГДЕ
        |	ВыпускПродукции.ЗаказКлиента = &Ссылка
        |	И ВыпускПродукции.Проведен = ИСТИНА";
    
    Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
    
    РезультатЗапроса = Запрос.Выполнить();
    ЕстьВыпуск = Не РезультатЗапроса.Пустой();
    
    // Управляем доступностью поля
    // Используем ТолькоПросмотр, чтобы менеджер мог видеть значение, но не менять
    Элементы.ТоварыВходнойКонтроль.ТолькоПросмотр = ЕстьВыпуск;
    
    // Управляем видимостью поясняющей надписи (UX-подсказка)
    Элементы.ДекорацияВходнойКонтрольЗаблокирован.Видимость = ЕстьВыпуск;
    
КонецПроцедуры

&НаКлиенте
Функция АналитикаСтрокиЗаполнена(СтрокаТЧ)
    // Строгий контроль: и товар, и характеристика должны быть выбраны
    Возврат ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) И ЗначениеЗаполнено(СтрокаТЧ.ХарактеристикиНоменклатуры);
КонецФункции

&НаКлиенте
Процедура ОбработатьИзменениеАналитикиСтроки(СтрокаТЧ)
    
    Если АналитикаСтрокиЗаполнена(СтрокаТЧ) Тогда
        // считаем все только когда об                                                                                                                                                                                                                                           с                                                                                                                                                                                                                                                                                                                                                                                                                                                                                   а поля готовы
        
        РассчитатьСтроку(СтрокаТЧ);
        ОбновитьВариантОбеспечения(СтрокаТЧ);
    Иначе
        // Если пользователь очистил характеристику или товар, сбрасываем расчеты
        СтрокаТЧ.НДССтавка 	= 0;
        //СтрокаТЧ.Сумма     	= 0;
        //СтрокаТЧ.НДС       	= 0;
        //СтрокаТЧ.ВсегоСНДС  = 0;
    КонецЕсли;                                            

КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСтроку(СтрокаТЧ)
    
    СтрокаТЧ.Сумма = СтрокаТЧ.Количество * СтрокаТЧ.ЦенаПродажи;
    
    СтрокаТЧ.НДССтавка = ПолучитьСтавкуНДСНаСервере();
    
    // НДС "сверху"
    СтрокаТЧ.НДС = СтрокаТЧ.Сумма * СтрокаТЧ.НДССтавка / 100;
    
    СтрокаТЧ.ВсегоСНДС = СтрокаТЧ.Сумма + СтрокаТЧ.НДС;
    
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВариантОбеспечения(СтрокаТЧ)
    
    // Если количество 0, запрашивать остатки бессмысленно
    Если СтрокаТЧ.Количество = 0 Тогда
        Возврат;
    КонецЕсли;
    
    СтрокаТЧ.ВариантОбеспеченияПоставки = ПолучитьВариантОбеспеченияНаСервере(
        СтрокаТЧ.Номенклатура, 
        СтрокаТЧ.ХарактеристикиНоменклатуры, 
        СтрокаТЧ.Количество
    );
    
КонецПроцедуры


// =====================================================================
// СЕРВЕРНЫЕ ФУНКЦИИ БЕЗ КОНТЕКСТА 
// (Остаются без изменений, логика полностью актуальна)
// =====================================================================

&НаСервереБезКонтекста
Функция ПолучитьСтавкуНДСНаСервере()
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ ПЕРВЫЕ 1
        |    СтавкаНДСТовар.Ставка КАК Ставка
        |ИЗ
        |    РегистрСведений.СтавкаНДСТовар КАК СтавкаНДСТовар";
        
    Результат = Запрос.Выполнить();
    
    Если Не Результат.Пустой() Тогда
        Выборка = Результат.Выбрать();
        Выборка.Следующий();
        Возврат Выборка.Ставка;
    КонецЕсли;
    
    Возврат 0; 
    
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьВариантОбеспеченияНаСервере(Номенклатура, Характеристика, ТребуемоеКоличество)
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |    ЕСТЬNULL(СУММА(Остатки.ОстатокОстаток), 0) КАК СвободныйОстаток
        |ИЗ
        |    РегистрНакопления.ОстаткиМатериалов.Остатки(
        |        ,
        |        Наименование = &Номенклатура
        |            И Характеристики = &Характеристика
        |            И Счет = ЗНАЧЕНИЕ(Документ.РасходнаяНакладная.ПустаяСсылка)) КАК Остатки";
        
    Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
    Запрос.УстановитьПараметр("Характеристика", Характеристика);
    
    СвободныйОстаток = 0;
    Выборка = Запрос.Выполнить().Выбрать();
    Если Выборка.Следующий() Тогда
        СвободныйОстаток = Выборка.СвободныйОстаток;
    КонецЕсли;
    
    Если СвободныйОстаток <= 0 Тогда
        Возврат Перечисления.ВариантОбеспеченияПоставки.ТолькоПроизводство;
    ИначеЕсли СвободныйОстаток >= ТребуемоеКоличество Тогда
        Возврат Перечисления.ВариантОбеспеченияПоставки.Резерв;
    Иначе
        Возврат Перечисления.ВариантОбеспеченияПоставки.РезервИДопроизводство;
    КонецЕсли;
    
КонецФункции

&НаСервереБезКонтекста
Функция НайтиТоварыИХарактеристикиНаСервере(ТекстПоиска)
    
    СписокВыбора = Новый СписокЗначений;
    
    // Подготавливаем массив разрешенных типов
    ДопустимыеТипы = Новый Массив;
    ДопустимыеТипы.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Продукция"));
    ДопустимыеТипы.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Комплект"));
    
    Запрос = Новый Запрос;
    // Ищем вхождение текста либо в имя товара, либо в имя характеристики
    Запрос.Текст = 
        "ВЫБРАТЬ ПЕРВЫЕ 30
        |	СпрНом.Ссылка КАК Номенклатура,
        |	ЕСТЬNULL(СпрХар.Ссылка, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика,
        |	СпрНом.Наименование КАК ИмяНом,
        |	ЕСТЬNULL(СпрХар.Наименование, """") КАК ИмяХар
        |ИЗ
        |	Справочник.НоменклатураМатериалы КАК СпрНом
        |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК СпрХар
        |		ПО СпрХар.Владелец = СпрНом.Ссылка
        |ГДЕ
        |	СпрНом.ЭтоГруппа = ЛОЖЬ
        |	И СпрНом.ПометкаУдаления = ЛОЖЬ
        |	// ФИЛЬТР ПО ТИПУ НОМЕНКЛАТУРЫ
        |	И СпрНом.ТипНоменклатуры В (&ДопустимыеТипы)
        |	И (ВЫРАЗИТЬ(СпрНом.Наименование КАК СТРОКА(250)) + "" "" + ЕСТЬNULL(СпрХар.Наименование, """")) ПОДОБНО &ТекстПоиска";

        
    // Оборачиваем текст в %, чтобы искать по подстроке
    Запрос.УстановитьПараметр("ТекстПоиска", "%" + ТекстПоиска + "%");
    Запрос.УстановитьПараметр("ДопустимыеТипы", ДопустимыеТипы);
    
    Выборка = Запрос.Выполнить().Выбрать();
    Пока Выборка.Следующий() Цикл
        
        // Формируем красивое представление: "Кабель (220В)"
        ТекПредставление = Выборка.ИмяНом;
        Если ЗначениеЗаполнено(Выборка.Характеристика) Тогда
            ТекПредставление = ТекПредставление + " (" + Выборка.ИмяХар + ")";
        КонецЕсли;
        
        // Упаковываем ссылки в структуру, чтобы передать их обратно на клиент
        ДанныеСвязки = Новый Структура;
        ДанныеСвязки.Вставить("Номенклатура", Выборка.Номенклатура);
        ДанныеСвязки.Вставить("Характеристика", Выборка.Характеристика);
        ДанныеСвязки.Вставить("Представление", ТекПредставление);
        
        // Добавляем в выпадающий список (Значение, Представление)
        СписокВыбора.Добавить(ДанныеСвязки, ТекПредставление);
        
    КонецЦикла;
    
    Возврат СписокВыбора;
    
КонецФункции


&НаСервере
Процедура ОбновитьВиртуальныеКолонкиНаСервере()
    // Ваша существующая логика формирования строк поиска
    Для Каждого СтрокаТЧ Из Объект.Товары Цикл
        Текст = Строка(СтрокаТЧ.Номенклатура);
        Если ЗначениеЗаполнено(СтрокаТЧ.ХарактеристикиНоменклатуры) Тогда
            Текст = Текст + " (" + Строка(СтрокаТЧ.ХарактеристикиНоменклатуры) + ")";
        КонецЕсли;
        СтрокаТЧ.СтрокаПоискаТовара = Текст;
    КонецЦикла;
КонецПроцедуры



#КонецОбласти
